; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 530509 2 3 2 3 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	infrared0 - mode
	image1 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star0 - direction
	Planet3 - direction
	Star4 - direction
	Planet5 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument2 image1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star0)
	(supports instrument3 image1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star0)
	(supports instrument4 infrared0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(have_image Planet3 infrared0)
	(have_image Star4 infrared0)
	(have_image Planet5 image1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 3
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 3
3. (turn_to satellite0 star0 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star0)
   goals met: 0 of 3
4. (turn_to satellite1 planet5 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet5)
   goals met: 0 of 3
5. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 3
6. (turn_to satellite1 planet3 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet3)
   goals met: 0 of 3
7. (turn_to satellite0 star4 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star4)
   goals met: 0 of 3
8. (turn_to satellite1 planet5 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 planet5)
   goals met: 0 of 3
9. (take_image satellite0 star4 instrument1 infrared0)
   added: (have_image star4 infrared0)
   goals met: 1 of 3
10. (turn_to satellite1 star0 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star0)
   goals met: 1 of 3
11. (turn_to satellite0 planet3 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet3)
   goals met: 1 of 3
12. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 1 of 3
13. (take_image satellite0 planet3 instrument1 infrared0)
   added: (have_image planet3 infrared0)
   goals met: 2 of 3
14. (turn_to satellite1 planet5 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet5)
   goals met: 2 of 3
15. (take_image satellite1 planet5 instrument2 image1)
   added: (have_image planet5 image1)
   goals met: 3 of 3
